# AreOptionsValid Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShape..::..AreOptionsValid Method
DirectShape Class See Also
---
Validates that the given DirectShapeOptions are allowed for this particular DirectShape.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool AreOptionsValid(
	DirectShapeOptions options
)
```

Visual Basic
---
```text
Public Function AreOptionsValid ( _
	options As DirectShapeOptions _
) As Boolean
```

Visual C++
---
```text
public:
bool AreOptionsValid(
	DirectShapeOptions^ options
)
```

# ### Parameters
options
    Type: Autodesk.Revit.DB..::..DirectShapeOptions The options object.
# ### Return Value
True if the DirectShapeOptions are valid; false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectShape Class
Autodesk.Revit.DB Namespace